////////////////////////////////////////////////////////////////////////////////////////////////
//
//  msToonCoordinator
//  Shade制御用fx ver1.0
//  作成:ましまし
//
////////////////////////////////////////////////////////////////////////////////////////////////

// 材質ごとに影を制御するパラメータ
// 使わないパラメータの先頭に // をつけてください

// ExcellentShadowの陰影を使う
#define USE_EXSHADOW

// ExShadowSSAOの陰影を使う
#define USE_EXSHADOWSSAO

// 強制的に影色にする
//#define BE_SHADOW

// 強制的にベース色にする
//#define BE_BASE

// 強制的にハイライト色にする
//#define BE_HIGHLIGHT

// テクスチャで影とライトを制御する
// Rチャンネル：ベース色の出やすさ。0で影響なし、1で強制的にベース色にする
// Gチャンネル：ハイライト色の出やすさ。0で影響なし、1で強制的にハイライト色にする
// Bチャンネル：陰色の出やすさ。0で影響なし、1で強制的に影色にする
//#define SHADOW_RATE_TEXTURE "texture.png"


/////////////////////////////////////////////////////////////////////////////////////////

#include "Shade_common.fxsub"