////////////////////////////////////////////////////////////////////////////////////////////////
//
//  msToonCoordinator
//  SubLight制御用fx ver1.0
//  作成:ましまし
//
////////////////////////////////////////////////////////////////////////////////////////////////

// 材質ごとに影を制御するパラメータ
// 使わないパラメータの先頭に // をつけてください

// ExcellentShadowの陰影を使う
//#define USE_EXSHADOW

// ExShadowSSAOの陰影を使う
//#define USE_EXSHADOWSSAO

// 強制的にサブライト１色にする
//#define BE_SUBLIGHT1

// 強制的にサブライト２色にする
//#define BE_SUBLIGHT2

// 強制的にハイ＆サブライト色をキャンセルする
//#define BE_LIGHTCANCELER

// テクスチャで影とライトを制御する
// Rチャンネル：サブライト1色の出やすさ。0で影響なし、1で強制的にサブライト1色にする
// Gチャンネル：サブライト2色の出やすさ。0で影響なし、1で強制的にサブライト2色にする
// Bチャンネル：ハイ＆サブライト色の出にくさ。0で影響なし、1で強制的にハイ＆サブライト色をキャンセルする
//#define SUBLIGHT_RATE_TEXTURE "texture.png"


/////////////////////////////////////////////////////////////////////////////////////////

#include "SubLight_common.fxsub"